In [16]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Geting Data

In [5]:
columns=["User_Id","Item_Id",'Rating','Timestamp']
data=pd.read_csv('u.data',sep='\t',names=columns)
data.head(5)

   User_Id  Item_Id  Rating  Timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [7]:
df=data.copy()
df.shape

(100000, 4)

In [10]:
# Number of Unique Users
df['User_Id'].nunique()

943

In [12]:
# Number of Unique Movies
len(df['Item_Id'].unique())

1682

In [22]:
movies=pd.read_csv('u.item',sep='\|',header=None,encoding = "ISO-8859-1")
df1=movies.copy()
df1.head(5)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [23]:
df1.shape

(1682, 24)

In [34]:
df2=df1[[0,1]]
df2

         0                                          1
0        1                           Toy Story (1995)
1        2                           GoldenEye (1995)
2        3                          Four Rooms (1995)
3        4                          Get Shorty (1995)
4        5                             Copycat (1995)
...    ...                                        ...
1677  1678                          Mat' i syn (1997)
1678  1679                           B. Monkey (1998)
1679  1680                       Sliding Doors (1998)
1680  1681                        You So Crazy (1994)
1681  1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [35]:
df2.columns=['Item_Id','Movie_Name']
df2

      Item_Id                                 Movie_Name
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [50]:
# Merging The Two DataFrames
df=pd.merge(df,df2,on='Item_Id')
df

,User_Id,Item_Id,Rating,Timestamp,Movie_Name_x,Movie_Name_y
0,196,242,3,881250949,Kolya (1996),Kolya (1996)
1,63,242,3,875747190,Kolya (1996),Kolya (1996)
2,226,242,5,883888671,Kolya (1996),Kolya (1996)
3,154,242,3,879138235,Kolya (1996),Kolya (1996)
4,306,242,5,876503793,Kolya (1996),Kolya (1996)
...,...,...,...,...,...,...
99995,840,1674,4,891211682,Mamma Roma (1962),Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)","Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996),Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1...","Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995),Dadetown (1995)